templates/templates_aph/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| APH Chamber CFD                                                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    aph_chamber.stl
    {
        type triSurfaceMesh;
        name aph_chamber;
        regions
        {
            floor { name floor; }
            walls { name walls; }
            ceiling { name ceiling; }
            left_inlet { name left_inlet; }
            right_inlet { name right_inlet; }
            exhaust_north { name exhaust_north; }
            exhaust_south { name exhaust_south; }
            exhaust_east { name exhaust_east; }
            exhaust_west { name exhaust_west; }
        }
    }
    aph_science_carrier.stl
    {
        type triSurfaceMesh;
        name aph_science_carrier;
        regions
        {
            carrier_tray { name carrier_tray; }
        }
    }
    aph_diffuser_left.stl
    {
        type triSurfaceMesh;
        name aph_diffuser_left;
    }
    aph_diffuser_right.stl
    {
        type triSurfaceMesh;
        name aph_diffuser_right;
    }
    
    shootVolume
    {
        type searchableBox;
        min (0 0 0.051);
        max (0.454 0.408 0.501);
    }
    inletJetsLeft
    {
        type searchableBox;
        min (0 0 0.051);
        max (0.1 0.408 0.066);
    }
    inletJetsRight
    {
        type searchableBox;
        min (0.354 0 0.051);
        max (0.454 0.408 0.066);
    }
}

castellatedMeshControls
{
    maxLocalCells 10000000;
    maxGlobalCells 20000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    features
    (
        { file "aph_chamber.eMesh"; level 1; }
        { file "aph_science_carrier.eMesh"; level 2; }
    );

    refinementSurfaces
    {
        aph_chamber
        {
            level (1 1);
            regions
            {
                floor { level (1 1); }
                walls { level (1 1); }
                ceiling { level (2 2); }
                left_inlet { level (2 2); }
                right_inlet { level (2 2); }
                exhaust_north { level (2 2); }
                exhaust_south { level (2 2); }
                exhaust_east { level (2 2); }
                exhaust_west { level (2 2); }
            }
        }
        aph_science_carrier
        {
            level (2 2);
            regions
            {
                carrier_tray { level (2 2); }
            }
        }
        aph_diffuser_left { level (3 3); faceZone diffuser_left; cellZone diffuser_left; cellZoneInside inside; }
        aph_diffuser_right { level (3 3); faceZone diffuser_right; cellZone diffuser_right; cellZoneInside inside; }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        shootVolume { mode inside; levels ((1e15 1)); }
        inletJetsLeft { mode inside; levels ((1e15 2)); }
        inletJetsRight { mode inside; levels ((1e15 2)); }
    }

    locationInMesh (0.227 0.204 0.25);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 300;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        "(floor|walls|ceiling|carrier_tray)"
        {
            nSurfaceLayers 4;
        }
    }

    expansionRatio 1.3;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 130;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    #include "meshQualityDict"
}

writeFlags
(
    scalarLevels
    layerSets
    layerFields
);
